GopalSaraf/Practicals/PSDL/include/proc/pic18f87j11.inc
// Register: CM1CON1
#define CM1CON1 CM1CON1
CM1CON1                                  equ 0FD2h
// bitfield definitions
CM1CON1_CCH_POSN                         equ 0000h
CM1CON1_CCH_POSITION                     equ 0000h
CM1CON1_CCH_SIZE                         equ 0002h
CM1CON1_CCH_LENGTH                       equ 0002h
CM1CON1_CCH_MASK                         equ 0003h
CM1CON1_CREF_POSN                        equ 0002h
CM1CON1_CREF_POSITION                    equ 0002h
CM1CON1_CREF_SIZE                        equ 0001h
CM1CON1_CREF_LENGTH                      equ 0001h
CM1CON1_CREF_MASK                        equ 0004h
CM1CON1_EVPOL_POSN                       equ 0003h
CM1CON1_EVPOL_POSITION                   equ 0003h
CM1CON1_EVPOL_SIZE                       equ 0002h
CM1CON1_EVPOL_LENGTH                     equ 0002h
CM1CON1_EVPOL_MASK                       equ 0018h
CM1CON1_CPOL_POSN                        equ 0005h
CM1CON1_CPOL_POSITION                    equ 0005h
CM1CON1_CPOL_SIZE                        equ 0001h
CM1CON1_CPOL_LENGTH                      equ 0001h
CM1CON1_CPOL_MASK                        equ 0020h
CM1CON1_COE_POSN                         equ 0006h
CM1CON1_COE_POSITION                     equ 0006h
CM1CON1_COE_SIZE                         equ 0001h
CM1CON1_COE_LENGTH                       equ 0001h
CM1CON1_COE_MASK                         equ 0040h
CM1CON1_CON_POSN                         equ 0007h
CM1CON1_CON_POSITION                     equ 0007h
CM1CON1_CON_SIZE                         equ 0001h
CM1CON1_CON_LENGTH                       equ 0001h
CM1CON1_CON_MASK                         equ 0080h
CM1CON1_C1CH0_POSN                       equ 0000h
CM1CON1_C1CH0_POSITION                   equ 0000h
CM1CON1_C1CH0_SIZE                       equ 0001h
CM1CON1_C1CH0_LENGTH                     equ 0001h
CM1CON1_C1CH0_MASK                       equ 0001h
CM1CON1_C1CH1_POSN                       equ 0001h
CM1CON1_C1CH1_POSITION                   equ 0001h
CM1CON1_C1CH1_SIZE                       equ 0001h
CM1CON1_C1CH1_LENGTH                     equ 0001h
CM1CON1_C1CH1_MASK                       equ 0002h
CM1CON1_EVPOL0_POSN                      equ 0003h
CM1CON1_EVPOL0_POSITION                  equ 0003h
CM1CON1_EVPOL0_SIZE                      equ 0001h
CM1CON1_EVPOL0_LENGTH                    equ 0001h
CM1CON1_EVPOL0_MASK                      equ 0008h
CM1CON1_EVPOL1_POSN                      equ 0004h
CM1CON1_EVPOL1_POSITION                  equ 0004h
CM1CON1_EVPOL1_SIZE                      equ 0001h
CM1CON1_EVPOL1_LENGTH                    equ 0001h
CM1CON1_EVPOL1_MASK                      equ 0010h
CM1CON1_CCH0_POSN                        equ 0000h
CM1CON1_CCH0_POSITION                    equ 0000h
CM1CON1_CCH0_SIZE                        equ 0001h
CM1CON1_CCH0_LENGTH                      equ 0001h
CM1CON1_CCH0_MASK                        equ 0001h
CM1CON1_CCH1_POSN                        equ 0001h
CM1CON1_CCH1_POSITION                    equ 0001h
CM1CON1_CCH1_SIZE                        equ 0001h
CM1CON1_CCH1_LENGTH                      equ 0001h
CM1CON1_CCH1_MASK                        equ 0002h
CM1CON1_CCH01_POSN                       equ 0000h
CM1CON1_CCH01_POSITION                   equ 0000h
CM1CON1_CCH01_SIZE                       equ 0001h
CM1CON1_CCH01_LENGTH                     equ 0001h
CM1CON1_CCH01_MASK                       equ 0001h
CM1CON1_CCH11_POSN                       equ 0001h
CM1CON1_CCH11_POSITION                   equ 0001h
CM1CON1_CCH11_SIZE                       equ 0001h
CM1CON1_CCH11_LENGTH                     equ 0001h
CM1CON1_CCH11_MASK                       equ 0002h
CM1CON1_COE1_POSN                        equ 0006h
CM1CON1_COE1_POSITION                    equ 0006h
CM1CON1_COE1_SIZE                        equ 0001h
CM1CON1_COE1_LENGTH                      equ 0001h
CM1CON1_COE1_MASK                        equ 0040h
CM1CON1_CON1_POSN                        equ 0007h
CM1CON1_CON1_POSITION                    equ 0007h
CM1CON1_CON1_SIZE                        equ 0001h
CM1CON1_CON1_LENGTH                      equ 0001h
CM1CON1_CON1_MASK                        equ 0080h
CM1CON1_CPOL1_POSN                       equ 0005h
CM1CON1_CPOL1_POSITION                   equ 0005h
CM1CON1_CPOL1_SIZE                       equ 0001h
CM1CON1_CPOL1_LENGTH                     equ 0001h
CM1CON1_CPOL1_MASK                       equ 0020h
CM1CON1_CREF1_POSN                       equ 0002h
CM1CON1_CREF1_POSITION                   equ 0002h
CM1CON1_CREF1_SIZE                       equ 0001h
CM1CON1_CREF1_LENGTH                     equ 0001h
CM1CON1_CREF1_MASK                       equ 0004h
CM1CON1_EVPOL01_POSN                     equ 0003h
CM1CON1_EVPOL01_POSITION                 equ 0003h
CM1CON1_EVPOL01_SIZE                     equ 0001h
CM1CON1_EVPOL01_LENGTH                   equ 0001h
CM1CON1_EVPOL01_MASK                     equ 0008h
CM1CON1_EVPOL11_POSN                     equ 0004h
CM1CON1_EVPOL11_POSITION                 equ 0004h
CM1CON1_EVPOL11_SIZE                     equ 0001h
CM1CON1_EVPOL11_LENGTH                   equ 0001h
CM1CON1_EVPOL11_MASK                     equ 0010h

// Register: OSCCON
#define OSCCON OSCCON
OSCCON                                   equ 0FD3h
// bitfield definitions
OSCCON_SCS_POSN                          equ 0000h
OSCCON_SCS_POSITION                      equ 0000h
OSCCON_SCS_SIZE                          equ 0002h
OSCCON_SCS_LENGTH                        equ 0002h
OSCCON_SCS_MASK                          equ 0003h
OSCCON_OSTS_POSN                         equ 0003h
OSCCON_OSTS_POSITION                     equ 0003h
OSCCON_OSTS_SIZE                         equ 0001h
OSCCON_OSTS_LENGTH                       equ 0001h
OSCCON_OSTS_MASK                         equ 0008h
OSCCON_IRCF_POSN                         equ 0004h
OSCCON_IRCF_POSITION                     equ 0004h
OSCCON_IRCF_SIZE                         equ 0003h
OSCCON_IRCF_LENGTH                       equ 0003h
OSCCON_IRCF_MASK                         equ 0070h
OSCCON_IDLEN_POSN                        equ 0007h
OSCCON_IDLEN_POSITION                    equ 0007h
OSCCON_IDLEN_SIZE                        equ 0001h
OSCCON_IDLEN_LENGTH                      equ 0001h
OSCCON_IDLEN_MASK                        equ 0080h
OSCCON_SCS0_POSN                         equ 0000h
OSCCON_SCS0_POSITION                     equ 0000h
OSCCON_SCS0_SIZE                         equ 0001h
OSCCON_SCS0_LENGTH                       equ 0001h
OSCCON_SCS0_MASK                         equ 0001h
OSCCON_SCS1_POSN                         equ 0001h
OSCCON_SCS1_POSITION                     equ 0001h
OSCCON_SCS1_SIZE                         equ 0001h
OSCCON_SCS1_LENGTH                       equ 0001h
OSCCON_SCS1_MASK                         equ 0002h
OSCCON_IRCF0_POSN                        equ 0004h
OSCCON_IRCF0_POSITION                    equ 0004h
OSCCON_IRCF0_SIZE                        equ 0001h
OSCCON_IRCF0_LENGTH                      equ 0001h
OSCCON_IRCF0_MASK                        equ 0010h
OSCCON_IRCF1_POSN                        equ 0005h
OSCCON_IRCF1_POSITION                    equ 0005h
OSCCON_IRCF1_SIZE                        equ 0001h
OSCCON_IRCF1_LENGTH                      equ 0001h
OSCCON_IRCF1_MASK                        equ 0020h
OSCCON_IRCF2_POSN                        equ 0006h
OSCCON_IRCF2_POSITION                    equ 0006h
OSCCON_IRCF2_SIZE                        equ 0001h
OSCCON_IRCF2_LENGTH                      equ 0001h
OSCCON_IRCF2_MASK                        equ 0040h

// Register: REFOCON
#define REFOCON REFOCON
REFOCON                                  equ 0FD3h
// bitfield definitions
REFOCON_RODIV_POSN                       equ 0000h
REFOCON_RODIV_POSITION                   equ 0000h
REFOCON_RODIV_SIZE                       equ 0004h
REFOCON_RODIV_LENGTH                     equ 0004h
REFOCON_RODIV_MASK                       equ 000Fh
REFOCON_ROSEL_POSN                       equ 0004h
REFOCON_ROSEL_POSITION                   equ 0004h
REFOCON_ROSEL_SIZE                       equ 0001h
REFOCON_ROSEL_LENGTH                     equ 0001h
REFOCON_ROSEL_MASK                       equ 0010h
REFOCON_ROSSLP_POSN                      equ 0005h
REFOCON_ROSSLP_POSITION                  equ 0005h
REFOCON_ROSSLP_SIZE                      equ 0001h
REFOCON_ROSSLP_LENGTH                    equ 0001h
REFOCON_ROSSLP_MASK                      equ 0020h
REFOCON_ROON_POSN                        equ 0007h
REFOCON_ROON_POSITION                    equ 0007h
REFOCON_ROON_SIZE                        equ 0001h
REFOCON_ROON_LENGTH                      equ 0001h
REFOCON_ROON_MASK                        equ 0080h
REFOCON_RODIV0_POSN                      equ 0000h
REFOCON_RODIV0_POSITION                  equ 0000h
REFOCON_RODIV0_SIZE                      equ 0001h
REFOCON_RODIV0_LENGTH                    equ 0001h
REFOCON_RODIV0_MASK                      equ 0001h
REFOCON_RODIV1_POSN                      equ 0001h
REFOCON_RODIV1_POSITION                  equ 0001h
REFOCON_RODIV1_SIZE                      equ 0001h
REFOCON_RODIV1_LENGTH                    equ 0001h
REFOCON_RODIV1_MASK                      equ 0002h
REFOCON_RODIV2_POSN                      equ 0002h
REFOCON_RODIV2_POSITION                  equ 0002h
REFOCON_RODIV2_SIZE                      equ 0001h
REFOCON_RODIV2_LENGTH                    equ 0001h
REFOCON_RODIV2_MASK                      equ 0004h
REFOCON_RODIV3_POSN                      equ 0003h
REFOCON_RODIV3_POSITION                  equ 0003h
REFOCON_RODIV3_SIZE                      equ 0001h
REFOCON_RODIV3_LENGTH                    equ 0001h
REFOCON_RODIV3_MASK                      equ 0008h

// Register: T0CON
#define T0CON T0CON
T0CON                                    equ 0FD5h
// bitfield definitions
T0CON_T0PS_POSN                          equ 0000h
T0CON_T0PS_POSITION                      equ 0000h
T0CON_T0PS_SIZE                          equ 0003h
T0CON_T0PS_LENGTH                        equ 0003h
T0CON_T0PS_MASK                          equ 0007h
T0CON_PSA_POSN                           equ 0003h
T0CON_PSA_POSITION                       equ 0003h
T0CON_PSA_SIZE                           equ 0001h
T0CON_PSA_LENGTH                         equ 0001h
T0CON_PSA_MASK                           equ 0008h
T0CON_T0SE_POSN                          equ 0004h
T0CON_T0SE_POSITION                      equ 0004h
T0CON_T0SE_SIZE                          equ 0001h
T0CON_T0SE_LENGTH                        equ 0001h
T0CON_T0SE_MASK                          equ 0010h
T0CON_T0CS_POSN                          equ 0005h
T0CON_T0CS_POSITION                      equ 0005h
T0CON_T0CS_SIZE                          equ 0001h
T0CON_T0CS_LENGTH                        equ 0001h
T0CON_T0CS_MASK                          equ 0020h
T0CON_T08BIT_POSN                        equ 0006h
T0CON_T08BIT_POSITION                    equ 0006h
T0CON_T08BIT_SIZE                        equ 0001h
T0CON_T08BIT_LENGTH                      equ 0001h
T0CON_T08BIT_MASK                        equ 0040h
T0CON_TMR0ON_POSN                        equ 0007h
T0CON_TMR0ON_POSITION                    equ 0007h
T0CON_TMR0ON_SIZE                        equ 0001h
T0CON_TMR0ON_LENGTH                      equ 0001h
T0CON_TMR0ON_MASK                        equ 0080h
T0CON_T0PS0_POSN                         equ 0000h
T0CON_T0PS0_POSITION                     equ 0000h
T0CON_T0PS0_SIZE                         equ 0001h
T0CON_T0PS0_LENGTH                       equ 0001h
T0CON_T0PS0_MASK                         equ 0001h
T0CON_T0PS1_POSN                         equ 0001h
T0CON_T0PS1_POSITION                     equ 0001h
T0CON_T0PS1_SIZE                         equ 0001h
T0CON_T0PS1_LENGTH                       equ 0001h
T0CON_T0PS1_MASK                         equ 0002h
T0CON_T0PS2_POSN                         equ 0002h
T0CON_T0PS2_POSITION                     equ 0002h
T0CON_T0PS2_SIZE                         equ 0001h
T0CON_T0PS2_LENGTH                       equ 0001h
T0CON_T0PS2_MASK                         equ 0004h
T0CON_T0PS3_POSN                         equ 0003h
T0CON_T0PS3_POSITION                     equ 0003h
T0CON_T0PS3_SIZE                         equ 0001h
T0CON_T0PS3_LENGTH                       equ 0001h
T0CON_T0PS3_MASK                         equ 0008h

